{
    "infinidbconfig": [
        { "xml_section": "HashJoin",
          "xml_parameter": "TotalUmMemory",
          "default" : "2G",
          "description" : "This setting constrains the maximum amount of memory available for managing intermediate results for joins, aggregations, and set operations on the User Module. This setting is shared across all queries active on a User Module. Expressed as 1%..100% or expressed in bytes such as 1G.",
          "em_category" : "UM",
          "em_parameter" : "TotalUmMemory",
          "value" : "2G" },
        { "xml_section": "HashJoin",
          "xml_parameter": "PmMaxMemorySmallSide",
          "default" : "64M",
          "description" : "This setting defines the maximum size of a small side join result set for a PM join. If the size of the data set is smaller than the PmMaxMemorySmallSide, the data will be sent to the PM(s) to allow creation of a distributed hash map. Otherwise, it will be created on the UM. The setting is individual to each small side result set. Expressed as 1%..100% or expressed in bytes such as 64M.",
          "em_category" : "PM",
          "em_parameter" : "PmMaxMemorySmallSide",
          "value" : "64M" },
        { "xml_section": "DBBC",
          "xml_parameter": "NumBlocksPct",
          "default" : "10",
          "description" : "This setting defines the amount of memory dedicated to the data buffer cache within each Performance Module. The setting is expressed as a percentage of a Performance Module's total memory. Valid value 1..100",
          "em_category" : "PM",
          "em_parameter" : "NumBlocksPct",
          "value" : "10" },
        { "xml_section": "VersionBuffer",
          "xml_parameter": "VersionBufferFileSize",
          "default" : "1GB",
          "description" : "This setting defines the amount of disk per DBRoot dedicated to the version buffer. The version buffer is used for rollbacks of DML statements. Valid value is 1G for 1 GB, 2G for 2GB, … Minimum values is 1G.",
          "em_category" : "PM",
          "em_parameter" : "VersionBufferFileSize",
          "value" : "1GB" },
        { "xml_section": "Installation",
          "xml_parameter": "CoreFileFlag",
          "default" : "n",
          "description" : "This setting determines whether core files will be produced upon abnormal termination of InfiniDB processes. Valid value is y or n.",
          "em_category" : "PM",
          "em_parameter" : "CoreFileFlag",
          "value" : "n" }  
    ]
}
